package main.java.com.ohgiraffers.section02.assignment;

public class Application {
    public static void main(String[] args) {

        /*
        * 대입 연산자와 산술 복합 대입 연산자
        *
        * '=' : 왼쪽의 피 연산자에 오른쪽의 피 연산자를 대입한다.
        * '+=' : 왼쪽의 피 연산자에 오른쪽의 피 연산자를 더한 결과를 대입한다.
        * '-=' : 왼쪽의 피 연산자에 오른쪽의 피 연산자를 뺀 값을 대입한다.
        * '*=' : 왼쪽의 피 연산자에 오른쪽의 피 연산자를 곱한 값을 대입한다.
        * '/=' : 왼쪽의 피 연산자에 오른쪽의 피 연산자를 나눈 값을 대입한다.
        * '%=' : 왼쪽의 피 연산자에 오른쪽의 피 연산자를 나눈 나머지 결과를 대입한다.
        * */

    }
}
